Revit 2017 API
RebarConstraint.GetTargetRebarEdgeNumber Method
 Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public int GetTargetRebarEdgeNumber()
Visual Basic
Public Function GetTargetRebarEdgeNumber As Integer
Visual C++
public:
int GetTargetRebarEdgeNumber()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.' -or- The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element.
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace